УТ_для_edt/src/InformationRegisters/смартКоэффициентыМенеджеров/смартКоэффициентыМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартКоэффициентыМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 15.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИзменениеКоэффициента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыдачаЗаблокирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыдачаЗаблокированаВручную</name>
    <comment>//++ #Б-3704 смарт: Фролов 07.07.2025 //Корректировка данных по отпускам и блокирование выдачи Интересов на основании данных регистра &quot;График отсутствия сотрудников&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКоэффициента</name>
    <type>
      <types>EnumRef.смартВидыКоэффициентовМенеджеров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартИсторияСтатусовСотрудников/смартИсторияСтатусовСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартИсторияСтатусовСотрудников</name>
  <comment>//++ #1739 смарт: Фролов 05.04.2024 //Создание рабочего места секретаря для распределения звонков и обращений.</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РучнойВвод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.смартСтатусыСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>До</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтсрочкиПоОтпуску</name>
    <comment>//++ #Б-2852 смарт: Фролов 11.04.2025 //Реализовать возможность присваивать Архивное &quot;Состояние СЦ&quot; Менеджерами СЦ</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартВыдачаЛидов/смартВыдачаЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартВыдачаЛидов</name>
  <comment>//++ #1543 смарт: Фролов 15.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <resources>
    <name>ВыдатьЛидов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыданоЛидов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.смартКвалификацииМенеджеров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартИсторияРаботыСЛидом/смартИсторияРаботыСЛидом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартИсторияРаботыСЛидом</name>
  <comment>//++ #1543 смарт: Фролов 23.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПервыйКонтакт</name>
    <type>
      <types>String</types>
      <types>AnyRef</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершенНеУдачно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Лид</name>
    <type>
      <types>DocumentRef.CRM_Заявка</types>
      <types>DocumentRef.смартЛид</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартВидыКоэффициентовМенеджеров/смартВидыКоэффициентовМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыКоэффициентовМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 07.12.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <enumValues>
    <name>ИтоговыйКоэффициент</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтВыручки</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтКонверсии</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтПотериЛидов</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтКоммерческогоОтдела</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтМаркетинговогоОтдела</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартСостоянияЛидов/смартСостоянияЛидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСостоянияЛидов</name>
  <comment>//++ #1624 смарт: Фролов 14.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.</comment>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Распределен</name>
  </enumValues>
  <enumValues>
    <name>ЗавершенУспешно</name>
  </enumValues>
  <enumValues>
    <name>ЗавершенНеУспешно</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ТипыТекстовЭлектронныхПисем/ТипыТекстовЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТекстовЭлектронныхПисем</name>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>ПростойТекст</name>
  </enumValues>
  <enumValues>
    <name>РазмеченныйТекст</name>
  </enumValues>
  <enumValues>
    <name>HTMLСКартинками</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/смартКвалификацииМенеджеров/смартКвалификацииМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартКвалификацииМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 10.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <predefined>
    <items>
      <name>РегистрацияПользователяНаСайте</name>
      <description>Регистрация пользователя на сайте</description>
    </items>
  </predefined>
  <attributes>
    <name>СценарийИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыйЭтап</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРеакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодВзаимодействияСКлиентом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукта</name>
    <type>
      <types>CatalogRef.смартТипыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПродажиВПрошлыхПеридах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоЛидовВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <comment>//++ #1748 смарт: Саломадин 05.04.2024 //Переход на единую воронку</comment>
    <type>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Сортировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеПроверятьНаличиеТоваров</name>
    <comment>//++ #Б-1198 смарт: Фролов 24.10.2024 //Исключение некоторых квалификаций из условий обязательного указания товаров в ТЧ товары</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеАктуальна</name>
    <comment>//++ #Б-4442 смарт: Фролов 30.09.2025 //Доработка механизма Квалификаций менеджеров.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбучения</name>
    <comment>//++ #Б-4944 смарт: Фролов 07.11.2025 //Доработка справочника Оборудование клиентов/Квалификации менеджеров.</comment>
    <type>
      <types>EnumRef.смартВидыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОценки</name>
    <comment>//++ #Б-4944 смарт: Фролов 07.11.2025 //Доработка справочника Оборудование клиентов/Квалификации менеджеров.</comment>
    <type>
      <types>EnumRef.смартВариантыОценкиОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>КвалификацияОбучения</name>
    <comment>//++ #Б-4944 смарт: Фролов 07.11.2025 //Доработка справочника Оборудование клиентов/Квалификации менеджеров.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукты</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыНоменклатуры</name>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиРассылок</name>
    <comment>//++ #1738 смарт: Фролов 02.04.2024 //Добавляем дополнительных получателей рассыки по квалификации.</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/смартКоэффициентыМенеджеров/Forms/ФормаКорректировкиКоэффициентов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Результат = ЗаполнитьДаннымиКоэффициентовМенеджеров();
	
	ЭтаФорма.Менеджеры.Загрузить(Результат);
	
	Если РольДоступна("смартРедактированиеКоэффициентовОтКоммерческогоОтдела") Тогда
		ЭтаФорма.ВидКоэффициента = Перечисления.смартВидыКоэффициентовМенеджеров.КоэффициентОтКоммерческогоОтдела;
		Элементы.МенеджерыКоэффициентОтКоммерческогоОтдела.ТолькоПросмотр = Ложь;
		Элементы.МенеджерыКоэффициентОтМаркетинговогоОтдела.ЦветФона = Новый Цвет(248,242,216);
	ИначеЕсли РольДоступна("смартРедактированиеКоэффициентовОтМаркетинговогоОтдела") Тогда
		ЭтаФорма.ВидКоэффициента = Перечисления.смартВидыКоэффициентовМенеджеров.КоэффициентОтМаркетинговогоОтдела;
		Элементы.МенеджерыКоэффициентОтМаркетинговогоОтдела.ТолькоПросмотр = Ложь;
		Элементы.МенеджерыКоэффициентОтКоммерческогоОтдела.ЦветФона = Новый Цвет(248,242,216);
	ИначеЕсли Пользователи.ЭтоПолноправныйПользователь() Тогда
		ЭтаФорма.ВидКоэффициента = Перечисления.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент;
		Элементы.МенеджерыКоэффициентОтКоммерческогоОтдела.ТолькоПросмотр = Ложь;
		Элементы.МенеджерыКоэффициентОтМаркетинговогоОтдела.ТолькоПросмотр = Ложь;
	//++ #Б-7014 смарт: Фролов 01.06.2026 //У руководителей ОП должна быть возможность смотреть отчет	
	Иначе	
		Элементы.ФормаСохранитьИЗакрыть.Доступность = Ложь;
		Элементы.ФормаСохранить.Доступность = Ложь;
		Элементы.Менеджеры.ТолькоПросмотр = Истина;
		Элементы.МаксимальноеКоличествоЛидовВДень.ТолькоПросмотр = Истина;
	//-- #Б-7014 смарт: Фролов 01.06.2026	
	КонецЕсли;
	
	ЭтаФорма.МаксимальноеКоличествоЛидовВДень = Константы.смартМаксимальноеКоличествоЛидовВДень.Получить();
	
	Элементы.ДекорацияСохранитеИзменения.Видимость = Ложь;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("МенеджерыКоэффициентОтКоммерческогоОтдела"); 
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Менеджеры.КоэффициентОтКоммерческогоОтдела");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементУсловия.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Менеджеры.КоэффициентОтКоммерческогоОтделаДляСравнения");;
	ЭлементУсловия.Использование = Истина;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("МенеджерыКоэффициентОтМаркетинговогоОтдела"); 
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Менеджеры.КоэффициентОтМаркетинговогоОтдела");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементУсловия.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Менеджеры.КоэффициентОтМаркетинговогоОтделаДляСравнения");;
	ЭлементУсловия.Использование = Истина;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("МенеджерыКоэффициентОтКоммерческогоОтдела"); 
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Менеджеры.КоэффициентОтКоммерческогоОтдела");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементУсловия.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Менеджеры.КоэффициентОтКоммерческогоОтделаДляСравнения");;
	ЭлементУсловия.Использование = Истина;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0,150,70));
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("МенеджерыКоэффициентОтМаркетинговогоОтдела"); 
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Менеджеры.КоэффициентОтМаркетинговогоОтдела");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементУсловия.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Менеджеры.КоэффициентОтМаркетинговогоОтделаДляСравнения");;
	ЭлементУсловия.Использование = Истина;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0,150,70));

КонецПроцедуры

&НаСервере
Функция ЗаполнитьДаннымиКоэффициентовМенеджеров(Менеджер = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	смартКоэффициентыМенеджеровСрезПоследних.Менеджер КАК Менеджер,
	|	СУММА(ВЫБОР
	|			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент)
	|				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.Коэффициент
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ИтоговыйКоэффициент,
	|	СУММА(ВЫБОР
	|			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтВыручки)
	|				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.ИзменениеКоэффициента
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоэффициентОтВыручки,
	|	СУММА(ВЫБОР
	|			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтКонверсии)
	|				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.ИзменениеКоэффициента
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоэффициентОтКонверсии,
	|	СУММА(ВЫБОР
	|			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтПотериЛидов)
	|				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.ИзменениеКоэффициента
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоэффициентОтПотериЛидов,
	|	СУММА(ВЫБОР
	|			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтКоммерческогоОтдела)
	|				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.ИзменениеКоэффициента
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоэффициентОтКоммерческогоОтдела,
	|	СУММА(ВЫБОР
	|			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтМаркетинговогоОтдела)
	|				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.ИзменениеКоэффициента
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоэффициентОтМаркетинговогоОтдела,
	|	СУММА(ВЫБОР
	|			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент)
	|				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.Коэффициент
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ИтоговыйКоэффициентСтарый,
	|	СУММА(ВЫБОР
	|			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтВыручки)
	|				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.Коэффициент
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоэффициентОтВыручкиСтарый,
	|	СУММА(ВЫБОР
	|			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтКонверсии)
	|				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.Коэффициент
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоэффициентОтКонверсииСтарый,
	|	МАКСИМУМ(смартКоэффициентыМенеджеровСрезПоследних.ВыдачаЗаблокирована) КАК КоэффициентОтПотериЛидовСтарый,
	|	СУММА(ВЫБОР
	|			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтКоммерческогоОтдела)
	|				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.Коэффициент
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоэффициентОтКоммерческогоОтделаСтарый,
	|	СУММА(ВЫБОР
	|			КОГДА смартКоэффициентыМенеджеровСрезПоследних.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтМаркетинговогоОтдела)
	|				ТОГДА смартКоэффициентыМенеджеровСрезПоследних.Коэффициент
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоэффициентОтМаркетинговогоОтделаСтарый,
	|	смартКоэффициентыМенеджеровСрезПоследних.Менеджер.Наименование КАК МенеджерНаименование,
	//++ #Б-3704 смарт: Фролов 07.07.2025 //Корректировка данных по отпускам и блокирование выдачи Интересов на основании данных регистра "График отсутствия сотрудников"
	|	МАКСИМУМ(смартКоэффициентыМенеджеровСрезПоследних.ВыдачаЗаблокированаВручную) КАК ВыдачаЗаблокированаВручную,
	//-- #Б-3704 смарт: Фролов 07.07.2025
	|	МАКСИМУМ(смартКоэффициентыМенеджеровСрезПоследних.ВыдачаЗаблокирована) КАК ВыдачаЗаблокирована
	|ПОМЕСТИТЬ ТаблицаКоэффициентов
	|ИЗ
	|	РегистрСведений.смартКоэффициентыМенеджеров.СрезПоследних(
	|			,
	|			Менеджер В
	|					(ВЫБРАТЬ
	|						Ссылка КАК Ссылка
	|					ИЗ
	|						Справочник.Пользователи
	|					ГДЕ
	|						НЕ Недействителен)
	|				И Менеджер В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Пользователь КАК Пользователь
	|					ИЗ
	|						Справочник.смартКвалификацииМенеджеров.Пользователи)
	|				И 1 = 1) КАК смартКоэффициентыМенеджеровСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	смартКоэффициентыМенеджеровСрезПоследних.Менеджер,
	|	смартКоэффициентыМенеджеровСрезПоследних.Менеджер.Наименование
	|;
	|
	//++ #Б-3406 смарт: Фролов 27.05.2025 //Создание механизма для отражения информации по отпускам менеджеров.
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пользователь КАК Менеджер,
	|	Период КАК НачалоОтпуска,
	|	До КАК ОкончаниеОтпуска
	|ПОМЕСТИТЬ Отпуска
	|ИЗ
	|	РегистрСведений.смартИсторияСтатусовСотрудников.СрезПоследних
	|ГДЕ
	|	Статус = ЗНАЧЕНИЕ(Справочник.смартСтатусыСотрудников.ВОтпуске)
	|	И До > &ТекущаяДата
	|;
	|
	//-- #Б-3406 смарт: Фролов 27.05.2025
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКоэффициентов.Менеджер КАК Менеджер,
	|	ТаблицаКоэффициентов.ИтоговыйКоэффициент КАК ИтоговыйКоэффициент,
	|	ТаблицаКоэффициентов.КоэффициентОтВыручки КАК КоэффициентОтВыручки,
	|	ТаблицаКоэффициентов.КоэффициентОтКонверсии КАК КоэффициентОтКонверсии,
	|	ТаблицаКоэффициентов.КоэффициентОтПотериЛидов КАК КоэффициентОтПотериЛидов,
	|	ТаблицаКоэффициентов.КоэффициентОтКоммерческогоОтдела КАК КоэффициентОтКоммерческогоОтдела,
	|	ТаблицаКоэффициентов.КоэффициентОтМаркетинговогоОтдела КАК КоэффициентОтМаркетинговогоОтдела,
	|	ТаблицаКоэффициентов.ИтоговыйКоэффициентСтарый КАК ИтоговыйКоэффициентСтарый,
	|	ТаблицаКоэффициентов.КоэффициентОтВыручкиСтарый КАК КоэффициентОтВыручкиСтарый,
	|	ТаблицаКоэффициентов.КоэффициентОтКонверсииСтарый КАК КоэффициентОтКонверсииСтарый,
	|	ТаблицаКоэффициентов.КоэффициентОтПотериЛидовСтарый КАК КоэффициентОтПотериЛидовСтарый,
	|	ТаблицаКоэффициентов.КоэффициентОтКоммерческогоОтделаСтарый КАК КоэффициентОтКоммерческогоОтделаСтарый,
	|	ТаблицаКоэффициентов.КоэффициентОтМаркетинговогоОтделаСтарый КАК КоэффициентОтМаркетинговогоОтделаСтарый,
	|	ТаблицаКоэффициентов.МенеджерНаименование КАК МенеджерНаименование,
	|	ТаблицаКоэффициентов.ВыдачаЗаблокирована КАК ВыдачаЗаблокирована,
	//++ #Б-3704 смарт: Фролов 07.07.2025 //Корректировка данных по отпускам и блокирование выдачи Интересов на основании данных регистра "График отсутствия сотрудников"
	|	ТаблицаКоэффициентов.ВыдачаЗаблокированаВручную КАК ВыдачаЗаблокированаВручную,
	//-- #Б-3704 смарт: Фролов 07.07.2025
	|	ТаблицаКоэффициентов.КоэффициентОтКоммерческогоОтдела КАК КоэффициентОтКоммерческогоОтделаДляСравнения,
	|	ТаблицаКоэффициентов.КоэффициентОтМаркетинговогоОтдела КАК КоэффициентОтМаркетинговогоОтделаДляСравнения,
	//++ #Б-3406 смарт: Фролов 27.05.2025 //Создание механизма для отражения информации по отпускам менеджеров.
	|	Отпуска.НачалоОтпуска КАК НачалоОтпуска,
	|	Отпуска.ОкончаниеОтпуска КАК ОкончаниеОтпуска
	//-- #Б-3406 смарт: Фролов 27.05.2025
	|ИЗ
	|	ТаблицаКоэффициентов КАК ТаблицаКоэффициентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Отпуска КАК Отпуска
	|		ПО ТаблицаКоэффициентов.Менеджер = Отпуска.Менеджер
	|
	|УПОРЯДОЧИТЬ ПО
	|	МенеджерНаименование";
	//++ #Б-3406 смарт: Фролов 27.05.2025 //Создание механизма для отражения информации по отпускам менеджеров.
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	//-- #Б-3406 смарт: Фролов 27.05.2025
	
	Если НЕ Менеджер = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Менеджер = &Менеджер");
		Запрос.УстановитьПараметр("Менеджер", Менеджер);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура СохранитьСервере()
	
	Результат = ЗаполнитьДаннымиКоэффициентовМенеджеров();
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка КАК Квалификация
	|ИЗ
	|	Справочник.смартКвалификацииМенеджеров.Пользователи 
	|ГДЕ
	|	Пользователь = &Менеджер");
	
	ДатаВнесения=ТекущаяДата();
	Для Каждого СтрМенеджеры Из Менеджеры Цикл
		
		СтрокиРезультат = Результат.НайтиСтроки(Новый Структура("Менеджер", СтрМенеджеры.Менеджер));
		Если СтрокиРезультат.Количество() > 0 Тогда
			
			Если СтрокиРезультат[0].КоэффициентОтКоммерческогоОтдела <> СтрМенеджеры.КоэффициентОтКоммерческогоОтдела Тогда
				МенеджерЗаписи=РегистрыСведений.смартКоэффициентыМенеджеров.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = ДатаВнесения;
				МенеджерЗаписи.Менеджер = СтрМенеджеры.Менеджер;
				МенеджерЗаписи.ВидКоэффициента = Перечисления.смартВидыКоэффициентовМенеджеров.КоэффициентОтКоммерческогоОтдела;
				МенеджерЗаписи.Коэффициент = СтрМенеджеры.КоэффициентОтКоммерческогоОтдела;
				МенеджерЗаписи.ИзменениеКоэффициента = СтрМенеджеры.КоэффициентОтКоммерческогоОтдела;
				МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийПользователь;
				МенеджерЗаписи.Записать();
			КонецЕсли;
			
			Если СтрокиРезультат[0].КоэффициентОтМаркетинговогоОтдела <> СтрМенеджеры.КоэффициентОтМаркетинговогоОтдела Тогда
				МенеджерЗаписи=РегистрыСведений.смартКоэффициентыМенеджеров.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = ДатаВнесения;
				МенеджерЗаписи.Менеджер = СтрМенеджеры.Менеджер;
				МенеджерЗаписи.ВидКоэффициента = Перечисления.смартВидыКоэффициентовМенеджеров.КоэффициентОтМаркетинговогоОтдела;
				МенеджерЗаписи.Коэффициент = СтрМенеджеры.КоэффициентОтМаркетинговогоОтдела;
				МенеджерЗаписи.ИзменениеКоэффициента = СтрМенеджеры.КоэффициентОтМаркетинговогоОтдела;
				МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийПользователь;
				МенеджерЗаписи.Записать();
			КонецЕсли;
			
			Если СтрокиРезультат[0].ИтоговыйКоэффициент <> СтрМенеджеры.ИтоговыйКоэффициент 
				//++ #Б-3704 смарт: Фролов 07.07.2025 //Корректировка данных по отпускам и блокирование выдачи Интересов на основании данных регистра "График отсутствия сотрудников"
				ИЛИ СтрокиРезультат[0].ВыдачаЗаблокированаВручную <> СтрМенеджеры.ВыдачаЗаблокированаВручную
				//-- #Б-3704 смарт: Фролов 07.07.2025
				ИЛИ СтрокиРезультат[0].ВыдачаЗаблокирована <> СтрМенеджеры.ВыдачаЗаблокирована Тогда
					МенеджерЗаписи=РегистрыСведений.смартКоэффициентыМенеджеров.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Период = ДатаВнесения;
					МенеджерЗаписи.Менеджер = СтрМенеджеры.Менеджер;
					МенеджерЗаписи.ВидКоэффициента = Перечисления.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент;
					МенеджерЗаписи.Коэффициент = СтрМенеджеры.ИтоговыйКоэффициент;
					МенеджерЗаписи.ИзменениеКоэффициента = СтрМенеджеры.ИтоговыйКоэффициент;
					МенеджерЗаписи.Ответственный = ПараметрыСеанса.ТекущийПользователь;
					МенеджерЗаписи.ВыдачаЗаблокирована = СтрМенеджеры.ВыдачаЗаблокирована;
					//++ #Б-3704 смарт: Фролов 07.07.2025 //Корректировка данных по отпускам и блокирование выдачи Интересов на основании данных регистра "График отсутствия сотрудников"
					МенеджерЗаписи.ВыдачаЗаблокированаВручную = СтрМенеджеры.ВыдачаЗаблокированаВручную;
					//-- #Б-3704 смарт: Фролов 07.07.2025
					МенеджерЗаписи.Записать();
					
					//++ #1681 смарт: Фролов 13.03.2024 //Механизм перераспределения Лидов/Интересов по ответственным.
					Если СтрМенеджеры.ВыдачаЗаблокирована Тогда
						
						СброситьВыданныеЛидыИИнтересы(СтрМенеджеры.Менеджер);
						
					КонецЕсли;	
					//-- #1681 смарт: Фролов 13.03.2024
					
					Запрос.УстановитьПараметр("Менеджер",СтрМенеджеры.Менеджер);
					Выборка = Запрос.Выполнить().Выбрать();
					
					Пока Выборка.Следующий() Цикл
						
						НаборЗаписей = РегистрыСведений.смартВыдачаЛидов.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.Менеджер.Установить(СтрМенеджеры.Менеджер);
						НаборЗаписей.Отбор.Квалификация.Установить(Выборка.Квалификация);
						НаборЗаписей.Прочитать();
						
						Если СтрМенеджеры.ВыдачаЗаблокирована ТОгда
							НаборЗаписей.Очистить();
						Иначе	
							Если НаборЗаписей.Количество() > 0 Тогда
								НаборЗаписей[0].ВыдатьЛидов = СтрМенеджеры.ИтоговыйКоэффициент;
								НаборЗаписей[0].ВыданоЛидов = НаборЗаписей[0].ВыданоЛидов;
							Иначе
								ЗаписьНЗ = НаборЗаписей.Добавить();
								ЗаписьНЗ.Менеджер = СтрМенеджеры.Менеджер;
								ЗаписьНЗ.Квалификация = Выборка.Квалификация;
								ЗаписьНЗ.ВыдатьЛидов = СтрМенеджеры.ИтоговыйКоэффициент;
								ЗаписьНЗ.ВыданоЛидов = 0;
							КонецЕсли;
						КонецЕсли;
						
						НаборЗаписей.Записать(Истина);
						
					КонецЦикла;
				
			КонецЕсли;
		
		КонецЕсли;
		
		//++ #Б-3406 смарт: Фролов 27.05.2025 //Создание механизма для отражения информации по отпускам менеджеров.
		Если ЗначениеЗаполнено(СтрМенеджеры.НачалоОтпуска) И ЗначениеЗаполнено(СтрМенеджеры.ОкончаниеОтпуска) Тогда
			
			ЗапросОтпуск = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Пользователь КАК Пользователь
			|ИЗ
			|	РегистрСведений.смартИсторияСтатусовСотрудников.СрезПоследних(, Пользователь = &Менеджер)
			|ГДЕ
			|	Статус = ЗНАЧЕНИЕ(Справочник.смартСтатусыСотрудников.ВОтпуске)
			|	И НАЧАЛОПЕРИОДА(До, ДЕНЬ) = &ОкончаниеОтпуска");
			ЗапросОтпуск.УстановитьПараметр("Менеджер", СтрМенеджеры.Менеджер);
			ЗапросОтпуск.УстановитьПараметр("ОкончаниеОтпуска", СтрМенеджеры.ОкончаниеОтпуска);
			
			Если ЗапросОтпуск.Выполнить().Пустой() Тогда
				
				МенеджерЗаписи = РегистрыСведений.смартИсторияСтатусовСотрудников.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = СтрМенеджеры.НачалоОтпуска;
				МенеджерЗаписи.Пользователь = СтрМенеджеры.Менеджер;
				МенеджерЗаписи.Статус = Справочники.смартСтатусыСотрудников.ВОтпуске;
				МенеджерЗаписи.До = СтрМенеджеры.ОкончаниеОтпуска;
				ОтсрочкаПоОтпуску = (СтрМенеджеры.ОкончаниеОтпуска - СтрМенеджеры.НачалоОтпуска) / 2;
				МенеджерЗаписи.ДатаОтсрочкиПоОтпуску = НачалоДня(СтрМенеджеры.ОкончаниеОтпуска + ОтсрочкаПоОтпуску);
				МенеджерЗаписи.Записать(Истина);
				
			КонецЕсли;
			//-- #Б-3406 смарт: Фролов 27.05.2025
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	СохранитьСервере();
	ЭтаФорма.Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьСервере();
	
	ЭтаФорма.Модифицированность = Ложь;
	
	Элементы.ДекорацияСохранитеИзменения.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоэффициентыПоМенеджеру(Менеджер)
	
	Результат = ЗаполнитьДаннымиКоэффициентовМенеджеров(Менеджер);
	Если Результат.Количество() > 0 ТОгда
		ИтКоэфф = Результат[0].ИтоговыйКоэффициент;
		КоэфКоммерчОтдела = Результат[0].КоэффициентОтКоммерческогоОтдела;
		КоэфМаркетОтдела = Результат[0].КоэффициентОтМаркетинговогоОтдела;
		Возврат Новый Структура("ИтоговыйКоэффициент,КоэффициентОтКоммерческогоОтдела,КоэффициентОтМаркетинговогоОтдела", ИтКоэфф, КоэфКоммерчОтдела, КоэфМаркетОтдела);
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура МенеджерыВыдачаЗаблокированаПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	
	Если ТекущиеДанные.ВыдачаЗаблокирована Тогда
		
		ТекущиеДанные.ИтоговыйКоэффициент = 0;
		
	Иначе
		
		//++ #Б-2900 смарт: Фролов 01.04.2025 //Ошибка. Корректировка коэффициентов менеджеров.
		//Результат = ПолучитьКоэффициентыПоМенеджеру(ТекущиеДанные.Менеджер);
		//Если НЕ Результат = Неопределено Тогда
		//	ТекущиеДанные.ИтоговыйКоэффициент = ?(Результат.ИтоговыйКоэффициент = 0, 2, Результат.ИтоговыйКоэффициент);
		//Иначе	
		//	ТекущиеДанные.ИтоговыйКоэффициент = 2;
		//КонецЕсли;
		РассчитатьИтоговыйКоэффициент(ТекущиеДанные);
		//-- #Б-2900 смарт: Фролов 01.04.2025
		
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
	//++ #Б-3704 смарт: Фролов 07.07.2025 //Корректировка данных по отпускам и блокирование выдачи Интересов на основании данных регистра "График отсутствия сотрудников"
	ТекущиеДанные.ВыдачаЗаблокированаВручную = ТекущиеДанные.ВыдачаЗаблокирована;
	//-- #Б-3704 смарт: Фролов 07.07.2025
	
	Элементы.ДекорацияСохранитеИзменения.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗначениеЗнаменателя(ТекущиеДанные)
	
	Знаменатель = 0;
	Если ТекущиеДанные.КоэффициентОтПотериЛидов <> 0 Тогда
		Знаменатель = Знаменатель + 1;	
	КонецЕсли;
	
	Если ТекущиеДанные.КоэффициентОтКоммерческогоОтдела <> 0 Тогда
		Знаменатель = Знаменатель + 1;	
	КонецЕсли;
	
	Если ТекущиеДанные.КоэффициентОтМаркетинговогоОтдела <> 0 Тогда
		Знаменатель = Знаменатель + 1;	
	КонецЕсли;
	
	Если ТекущиеДанные.КоэффициентОтВыручки <> 0 Тогда
		Знаменатель = Знаменатель + 1;	
	КонецЕсли;
	
	Если ТекущиеДанные.КоэффициентОтКонверсии <> 0 Тогда
		Знаменатель = Знаменатель + 1;	
	КонецЕсли;
	
	Возврат Знаменатель;
	
КонецФункции	

&НаКлиенте
Процедура РассчитатьИтоговыйКоэффициент(ТекущиеДанные)
	
	Результат = ПолучитьКоэффициентыПоМенеджеру(ТекущиеДанные.Менеджер);
	
	Знаменатель = ПолучитьЗначениеЗнаменателя(ТекущиеДанные);
	
	КоэфПотериЛидов = ТекущиеДанные.КоэффициентОтПотериЛидов;
	КоэфКоммерчОтдела = ТекущиеДанные.КоэффициентОтКоммерческогоОтдела;
	КоэфМаркетОтдела = ТекущиеДанные.КоэффициентОтМаркетинговогоОтдела;
	КоэфОтВыручки = ТекущиеДанные.КоэффициентОтВыручки;
	КоэфОтКонверсии = ТекущиеДанные.КоэффициентОтКонверсии;
	
	Если Знаменатель > 0 ТОгда
		
		ИзменениеКоэффициента = Окр((КоэфПотериЛидов + КоэфКоммерчОтдела + КоэфМаркетОтдела 
			+ КоэфОтВыручки + КоэфОтКонверсии) / Знаменатель);
		ТекущиеДанные.ИтоговыйКоэффициент = 2 + ИзменениеКоэффициента;
		ЭтаФорма.Модифицированность = Истина;
		Элементы.ДекорацияСохранитеИзменения.Видимость = Истина;
		
	Иначе
		
		//++ #Б-2900 смарт: Фролов 01.04.2025 //Ошибка. Корректировка коэффициентов менеджеров.
		//ТекущиеДанные.ИтоговыйКоэффициент = Результат.ИтоговыйКоэффициент;
		ТекущиеДанные.ИтоговыйКоэффициент = 2;
		//-- #Б-2900 смарт: Фролов 01.04.2025
		
	КонецЕсли;
	
	Если ТекущиеДанные.ИтоговыйКоэффициент < 1 Тогда
		
		ТекущиеДанные.ИтоговыйКоэффициент = 1;
		
	ИначеЕсли ТекущиеДанные.ИтоговыйКоэффициент > 4 Тогда
		
		ТекущиеДанные.ИтоговыйКоэффициент = 4;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура МенеджерыКоэффициентОтКоммерческогоОтделаПриИзменении(Элемент)
	
	РассчитатьИтоговыйКоэффициент(Элемент.Родитель.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура МенеджерыКоэффициентОтМаркетинговогоОтделаПриИзменении(Элемент)

	РассчитатьИтоговыйКоэффициент(Элемент.Родитель.ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура МаксимальноеКоличествоЛидовВДеньПриИзмененииНаСервере()
	
	Константы.смартМаксимальноеКоличествоЛидовВДень.Установить(МаксимальноеКоличествоЛидовВДень);
	
КонецПроцедуры

&НаКлиенте
Процедура МаксимальноеКоличествоЛидовВДеньПриИзменении(Элемент)
	МаксимальноеКоличествоЛидовВДеньПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЭтаФорма.Модифицированность И НЕ ЗавершениеРаботы ТОгда
		Отказ = Истина;
		Режим = РежимДиалогаВопрос.ДаНетОтмена;
		Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаПриЗакрытии",ЭтотОбъект);
		ПоказатьВопрос(Оповещение,"Изменения не сохранены, сохранить?", Режим,,КодВозвратаДиалога.Отмена,"Изменения не сохранены");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаПриЗакрытии(Результат,ДопПараметры)Экспорт
	
	Если Результат=КодВозвратаДиалога.Да Тогда 
		СохранитьСервере();
		ЭтаФорма.Модифицированность = Ложь;
		ЭтаФорма.Закрыть();
	ИначеЕсли Результат=КодВозвратаДиалога.Нет Тогда
		ЭтаФорма.Модифицированность = Ложь;
		ЭтаФорма.Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
//++ #1681 смарт: Фролов 13.03.2024 //Механизм перераспределения Лидов/Интересов по ответственным.
Процедура СброситьВыданныеЛидыИИнтересы(Менеджер)
	//++ #1681 смарт: Фролов 22.04.2024 //Механизм перераспределения Лидов/Интересов по ответственным.
	УстановитьПривилегированныйРежим(Истина);
	//-- #1681 смарт: Фролов 22.04.2024
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	смартИсторияРаботыСЛидом.Лид КАК Лид,
	|	CRM_Интерес.Ссылка КАК Интерес
	|ИЗ
	|	РегистрСведений.смартИсторияРаботыСЛидом КАК смартИсторияРаботыСЛидом
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CRM_Интерес КАК CRM_Интерес
	|		ПО смартИсторияРаботыСЛидом.Лид = CRM_Интерес.ДокументОснование
	|ГДЕ
	|	смартИсторияРаботыСЛидом.ДатаВыдачи > &ДатаВыдачи
	|	И смартИсторияРаботыСЛидом.Менеджер = &Менеджер
	|	И смартИсторияРаботыСЛидом.ДатаОбработки = ДАТАВРЕМЯ(1, 1, 1)");
	Запрос.УстановитьПараметр("ДатаВыдачи", Началодня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		ОбЛид = Выборка.Лид.ПолучитьОбъект();
		ОбЛид.Ответственный = Неопределено;
		ОбЛид.СостояниеЛида = Перечисления.смартСостоянияЛидов.Новый;
		ОбЛид.Записать(РежимЗаписиДокумента.Запись);
		
		Если ЗначениеЗаполнено(Выборка.Интерес) Тогда
			
			ОбИнтерес = Выборка.Интерес.ПолучитьОбъект();
			ОбИнтерес.Ответственный = Неопределено;
			ОбИнтерес.Записать(РежимЗаписиДокумента.Запись);
			
		КонецЕсли;	
		
		НаборЗаписей = РегистрыСведений.смартИсторияРаботыСЛидом.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Менеджер.Установить(Менеджер);
		НаборЗаписей.Отбор.Лид.Установить(Выборка.Лид);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		НаборЗаписей.Записать(Истина);
		
		//++ #Б-5936 смарт: Фролов 06.03.2026 //Ошибка. Доработать механизм перераспределения лидов.
		НаборЗаписей = РегистрыСведений.смартИсторияРаботыСЛидом.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Лид.Установить(Выборка.Лид);
		НаборЗаписей.Отбор.Менеджер.Установить(Менеджер);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			СтрНаборЗаписей = НаборЗаписей[0];
			СтрНаборЗаписей.ДатаЗавершения = ТекущаяДата();
			СтрНаборЗаписей.ПервыйКонтакт = "Лид передан в связи с блокировкой";
			СтрНаборЗаписей.ЗавершенНеУдачно = Истина;
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
		//-- #Б-5936 смарт: Фролов 06.03.2026
		
		ЛидИлиИнтерес = ?(ЗначениеЗаполнено(Выборка.Интерес),"Лид","Интерес");
		
		ОтправитьНаПочтуМенеджеру("Выданный ранее " + ЛидИлиИнтерес	+ " передан другому менеджеру", 
			Менеджер, Выборка.Лид, ?(ЗначениеЗаполнено(Выборка.Интерес), Выборка.Интерес, Неопределено));
			
	КонецЦикла;	
	
КонецПроцедуры	//-- #1681 смарт: Фролов 13.03.2024

&НаСервере
Процедура ОтправитьНаПочтуМенеджеру(ТемаПисьма, Менеджер, Лид, Интерес)

	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();

	ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
	ТестовыеАдресаСтрока = "";
	ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока); 

	АдресаДляОтправкиСтрокой = "";
	МассивАдресовДляОтправки = ПолучитьАдресаПолучателейУведомлений(АдресаДляОтправкиСтрокой, Менеджер);

	ОбЛид = Лид.ПолучитьОбъект();
	НавСсылка = ПолучитьНавигационнуюСсылку(ОбЛид);

	//++ #Б-4362 смарт: Фролов 17.09.2025 //Ошибка ЖР. РС смартКоэффициентыМенеджеров
	//Если Лид.ДокументОснование.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
	Если ЗначениеЗаполнено(Лид.ДокументОснование) 
		И ТипЗнч(Лид.ДокументОснование) = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее")
		И Лид.ДокументОснование.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
	//-- #Б-4362 смарт: Фролов 17.09.2025
		ТекстСодержания = Взаимодействия.ПолучитьОбычныйТекстИзHTML(Лид.ТекстИсточника);
	Иначе	
		ТекстСодержания = Лид.ТекстИсточника;
	КонецЕсли;

	Если Интерес = Неопределено ТОгда
		
		ТекстПисьма = "Лид ранее назначенный Вам, передан другому менеджеру: " + 
		ТекстПисьма = ТекстПисьма + Лид.Номер+" от "+Формат(Лид.Дата,"ДФ=dd.MM.yyyy")+" | "; 
		ТекстПисьма = ТекстПисьма + "Навигационная ссылка на документ: " + НавСсылка + "" + Символы.ПС;
		ТекстПисьма = ТекстПисьма + "Телефон: " + Лид.Телефон + Символы.ПС + "Электронная почта: "
			+ Лид.ЭлектроннаяПочта + Символы.ПС + "Регион: " + Лид.БизнесРегионТекст + Символы.ПС;
		ТекстПисьма = ТекстПисьма + "Продукт: " + Лид.Продукт + Символы.ПС + "Контакт: " + Лид.Имя + Символы.ПС;
		ТекстПисьма = ТекстПисьма + "=================================================================================" + Символы.ПС + Символы.ПС;
		ТекстПисьма = ТекстПисьма + "Текст источника: " + ТекстСодержания + Символы.ПС;
		
	Иначе	
		
		ОбИнтерес = Интерес.ПолучитьОбъект();
		НавСсылкаИнтерес = ПолучитьНавигационнуюСсылку(ОбИнтерес);
		ТекстПисьма = "Интерес ранее назначенный Вам, передан другому менеджеру: "+ Символы.ПС + Символы.ПС + Символы.ПС;
		ТекстПисьма = ТекстПисьма + Интерес.Номер+" от "+Формат(Интерес.Дата,"ДФ=dd.MM.yyyy")+" | "+Интерес.Тема+Символы.ПС;
		ТекстПисьма = ТекстПисьма + "Навигационная ссылка на документ: " + НавСсылкаИнтерес + "" + Символы.ПС;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УчетнаяЗапись)
		И (ТестовыеАдресаМассив.Количество() > 0
		ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
		
		ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма + " - " + Лид.Тема + "", ТекстПисьма);
		ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки, 
			, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
		
		Попытка
			ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
		Исключение
			ТекстСообщения = "Не удалось отправить письмо, менеджеру " + Менеджер + " по лиду " + Лид + Символы.ПС + ОписаниеОшибки(); 
			ЗаписьЖурналаРегистрации("ОтправкаПисьма", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресаПолучателейУведомлений(АдресаДляОтправкиСтрокой = "", Менеджер=Неопределено) 
	
	МассивАдресов = Новый Массив;
	
	АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Менеджер.смартРабочаяПочта);
	
	Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
		
		МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
		АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
		
	КонецЦикла;
	
	Возврат МассивАдресов;
	
КонецФункции
